data/request1.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:rfc:functions"><soapenv:Header /><soapenv:Body><urn:RFC_CALL_TRANSACTION_USING><MODE>S</MODE><TCODE>FBV0</TCODE><BT_DATA><item><PROGRAM>SAPMF05V</PROGRAM><DYNPRO>0100</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>/00</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>RF05V-BELNR</FNAM><FVAL>1900013343</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>RF05V-BUKRS</FNAM><FVAL>1400</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>RF05V-GJAHR</FNAM><FVAL>2020</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0700</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=BK</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0600</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=AB</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BKPF-BUDAT</FNAM><FVAL>05032020</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0700</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=ZLO</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_CURSOR</FNAM><FVAL>RF05V-ANZDT(1)</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0700</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>/00</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>RF05V-NEWBS</FNAM><FVAL>31</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>RF05V-NEWKO</FNAM><FVAL>5005274</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0302</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=ZK</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-WRBTR</FNAM><FVAL>1210</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-ZTERM</FNAM><FVAL>Z014</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0332</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=AB</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0700</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>/00</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>RF05V-NEWBS</FNAM><FVAL>40</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>RF05V-NEWKO</FNAM><FVAL>4689022</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0300</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=ZK</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-WRBTR</FNAM><FVAL>1000</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-MWSKZ</FNAM><FVAL>V5</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-SGTXT</FNAM><FVAL></FVAL></item><item><PROGRAM>SAPLKACB</PROGRAM><DYNPRO>0002</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=ENTE</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>330</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=AB</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0700</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=PI</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_CURSOR</FNAM><FVAL>RF05V-ANZDT(01)</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0302</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=STER</FVAL></item><item><PROGRAM>SAPLTAX1</PROGRAM><DYNPRO>0300</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=DELZ</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>BSET-FWSTE(01)</FVAL></item><item><PROGRAM>SAPLTAX1</PROGRAM><DYNPRO>0300</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSET-FWSTE(01)</FNAM><FVAL>210</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSET-MWSKZ(01)</FNAM><FVAL>V5</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-BSCHL(01)</FNAM><FVAL>40</FVAL></item><item><PROGRAM>SAPLTAX1</PROGRAM><DYNPRO>0300</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=GO</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0302</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=AB</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0700</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=BU</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0700</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>/EEND</FVAL></item><item><PROGRAM>SAPLSPO1</PROGRAM><DYNPRO>0200</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=Yes</FVAL></item></BT_DATA><L_ERRORS><!--Zero or more repetitions:--><item><!--Optional:--><TCODE /><!--Optional:--><DYNAME /><!--Optional:--><DYNUMB /><!--Optional:--><MSGTYP /><!--Optional:--><MSGSPRA /><!--Optional:--><MSGID /><!--Optional:--><MSGNR /><!--Optional:--><MSGV1 /><!--Optional:--><MSGV2 /><!--Optional:--><MSGV3 /><!--Optional:--><MSGV4 /><!--Optional:--><ENV /><!--Optional:--><FLDNAME /></item></L_ERRORS></urn:RFC_CALL_TRANSACTION_USING></soapenv:Body></soapenv:Envelope>
